music.org
#+title: Music Journal
#+author: [[https://shosseinib.github.io][shosseinib]], a noise enthusiast

#+SETUPFILE: ./../setupfiles/comfy_inline.theme
#+OPTIONS: num:nil
#+FILETAGS: music


* *Code of Conduct*
Here I collect music albums that I consider worshiped (in my way) works in ~Jazz~, ~Post-Everything~, ~Noise~, ~*Metal~, ~Electronic~, and ~Experimental & Improvisation~. The order is by year, but there is no order; I may re-sort them by their artist name later; who knows?
   
* *Electronic*
** 2021
- Doyeq *Never Back* [[https://fuselab.bandcamp.com/album/never-back][bandcamp]]
- HEXSYSTEM *Interface OST Vol. II* [[https://hexsystem.bandcamp.com/album/interface-ost-vol-ii?from=fandiscflw][bandcamp]]
** 2022
- HEXSYSTEM *No Confluence* [[https://hexsystem.bandcamp.com/album/no-confluence?from=fanpub_fnb][bandcamp]]
- TaboTago *TaboTago* [[https://tabotago.bandcamp.com/album/sessions-010-20220422-live-at-zionskirche-berlin?from=fanpub_nfnb&utm_source=album_release&utm_medium=email&utm_content=fanpub_nfnb&utm_campaign=tabotago+album+sessions-010-20220422-live-at-zionskirche-berlin][bandcamp]]
  #+begin_quote
  A tribute, a great live performance. I wish I could be at that concert.
  #+end_quote
* *Experimental & Improvisation*
** 2019
- Sam Andreae/David Birchall/Toshimaru Nakamura/Otto Willberg *UK ツアー 2019* [[https://scatterarchive.bandcamp.com/album/uk-2019?from=fandiscflw][bandcamp]]
** 2020
- Jean-Luc Guionnet, Annette Krebs *pointe sèche* [[https://annettekrebs.bandcamp.com/album/pointe-s-che][bandcamp]]
** 2021
- Guilherme Rodrigues & Carlos Santos *Uncommon Symmetries* [[https://guilhermerodrigues.bandcamp.com/album/uncommon-symmetries][bandcamp]]
- I/O - Carlos Santos and Ulrich Mitzlaff *Studies on Colour Field Modulation* [[https://carlossantos.bandcamp.com/album/studies-on-colour-field-modulation][bandcamp]]
- Omawi featuring Alistair Payne, Ingebrigt Håker Flaten *Omawi: Live at Roze Tanker* [[https://doekraw.bandcamp.com/album/omawi-live-at-roze-tanker][bandcamp]]
- Guitar Party Power (IMP021) *Bob Log III* [[https://improvedsequence.bandcamp.com/album/guitar-party-power-imp021?from=fanpub_fnb_merch][bandcamp]]
** 2022
- Mark Wagner *S☉N RISE / S☉N OF THE SUN* [[https://zamzamrec.bandcamp.com/album/s-n-rise-s-n-of-the-sun][bandcamp]]
-  Adela Mede *Szabadság* [[https://adelamede.bandcamp.com/album/szabads-g-3?entry_type=a&from=newsletter-48620331&newsletter_id=48620331&newsletter_sig=aLi9o4WmsIeiNifL3%2FqQ3mfyM40%3D][bandcamp]]
  #+begin_quote
  I love how the Slovak language is like the Icelandic language. After listening to this album, I've searched a little about Slovakia and found some interesting facts. By the way, I've liked the entire natural-leading process of the album. Feature track: *=6. Interlude III=*!
  #+end_quote
- Healing Potpourri *Paradise* [[https://healingpotpourri.bandcamp.com/album/paradise?from=embed][bandcamp]]
  #+begin_quote
  Ok, I should confess. At first, I was not too fond of the album because I thought it was a *=Stephan Stevens=* -y album, but as it sought forward, I found it's a complicated multi-instrumental album. With great tuning, orchestra, and lyrics. Great. Great. Favourite Track: *=6. Paradise=*.
  #+end_quote
* *Jazz*
** 2019
- Enrico Rava & Joe Lovano *Roma (Live)* [[https://open.spotify.com/album/7oJD5GX7laQuDzSz10eKS2][spotify]]
