music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-24 Fri 15:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Music Journal</title>
<meta name="author" content="[[https://shosseinib.github.io][shosseinib]], a noise enthusiast" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Music Journal</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb49edf6"><b>Code of Conduct</b></a></li>
<li><a href="#org68c5c4b"><b>Electronic</b></a>
<ul>
<li><a href="#org458a804">2021</a></li>
<li><a href="#orga83ba30">2022</a></li>
</ul>
</li>
<li><a href="#orgd4b897b"><b>Experimental &amp; Improvisation</b></a>
<ul>
<li><a href="#orgff120d1">2019</a></li>
<li><a href="#org9896b96">2020</a></li>
<li><a href="#org1425bce">2021</a></li>
<li><a href="#org6061fa4">2022</a></li>
</ul>
</li>
<li><a href="#org9adf0e0"><b>Jazz</b></a>
<ul>
<li><a href="#org603b5b0">2019</a></li>
<li><a href="#orgc87babb">2021</a></li>
<li><a href="#orgd2b7088">2022</a></li>
</ul>
</li>
<li><a href="#org4681010"><b>*Metal</b></a>
<ul>
<li><a href="#org640bf45">Black</a></li>
<li><a href="#org97c5667">Death</a>
<ul>
<li><a href="#orgf02dfee">2022</a></li>
</ul>
</li>
<li><a href="#orgf0233d2">Doom</a>
<ul>
<li><a href="#org53d8ca6">2021</a></li>
<li><a href="#org035c408">2022</a></li>
</ul>
</li>
<li><a href="#org8a15508">Progressive</a></li>
</ul>
</li>
<li><a href="#org5adfc11"><b>Noise</b></a>
<ul>
<li><a href="#orgb4cafe1">2022</a></li>
</ul>
</li>
<li><a href="#org6444219"><b>Post-everything</b></a>
<ul>
<li><a href="#orgdde0054">2021</a></li>
<li><a href="#org3c36214">2022</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgb49edf6" class="outline-2">
<h2 id="orgb49edf6"><b>Code of Conduct</b></h2>
<div class="outline-text-2" id="text-orgb49edf6">
<p>
Here I collect music albums that I consider worshiped (in my way) works in <code>Jazz</code>, <code>Post-Everything</code>, <code>Noise</code>, <code>*Metal</code>, <code>Electronic</code>, and <code>Experimental &amp; Improvisation</code>. The order is by year, but there is no order; I may re-sort them by their artist name later; who knows?
</p>
</div>
</div>

<div id="outline-container-org68c5c4b" class="outline-2">
<h2 id="org68c5c4b"><b>Electronic</b></h2>
<div class="outline-text-2" id="text-org68c5c4b">
</div>
<div id="outline-container-org458a804" class="outline-3">
<h3 id="org458a804">2021</h3>
<div class="outline-text-3" id="text-org458a804">
<ul class="org-ul">
<li>Doyeq <b>Never Back</b> <a href="https://fuselab.bandcamp.com/album/never-back">bandcamp</a></li>
<li>HEXSYSTEM <b>Interface OST Vol. II</b> <a href="https://hexsystem.bandcamp.com/album/interface-ost-vol-ii?from=fandiscflw">bandcamp</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga83ba30" class="outline-3">
<h3 id="orga83ba30">2022</h3>
<div class="outline-text-3" id="text-orga83ba30">
<ul class="org-ul">
<li>HEXSYSTEM <b>No Confluence</b> <a href="https://hexsystem.bandcamp.com/album/no-confluence?from=fanpub_fnb">bandcamp</a></li>
<li><p>
TaboTago <b>TaboTago</b> <a href="https://tabotago.bandcamp.com/album/sessions-010-20220422-live-at-zionskirche-berlin?from=fanpub_nfnb&amp;utm_source=album_release&amp;utm_medium=email&amp;utm_content=fanpub_nfnb&amp;utm_campaign=tabotago+album+sessions-010-20220422-live-at-zionskirche-berlin">bandcamp</a>
</p>
<blockquote>
<p>
A tribute, a great live performance. I wish I could be at that concert.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd4b897b" class="outline-2">
<h2 id="orgd4b897b"><b>Experimental &amp; Improvisation</b></h2>
<div class="outline-text-2" id="text-orgd4b897b">
</div>
<div id="outline-container-orgff120d1" class="outline-3">
<h3 id="orgff120d1">2019</h3>
<div class="outline-text-3" id="text-orgff120d1">
<ul class="org-ul">
<li>Sam Andreae/David Birchall/Toshimaru Nakamura/Otto Willberg <b>UK ツアー 2019</b> <a href="https://scatterarchive.bandcamp.com/album/uk-2019?from=fandiscflw">bandcamp</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9896b96" class="outline-3">
<h3 id="org9896b96">2020</h3>
<div class="outline-text-3" id="text-org9896b96">
<ul class="org-ul">
<li>Jean-Luc Guionnet, Annette Krebs <b>pointe sèche</b> <a href="https://annettekrebs.bandcamp.com/album/pointe-s-che">bandcamp</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1425bce" class="outline-3">
<h3 id="org1425bce">2021</h3>
<div class="outline-text-3" id="text-org1425bce">
<ul class="org-ul">
<li>Guilherme Rodrigues &amp; Carlos Santos <b>Uncommon Symmetries</b> <a href="https://guilhermerodrigues.bandcamp.com/album/uncommon-symmetries">bandcamp</a></li>
<li>I/O - Carlos Santos and Ulrich Mitzlaff <b>Studies on Colour Field Modulation</b> <a href="https://carlossantos.bandcamp.com/album/studies-on-colour-field-modulation">bandcamp</a></li>
<li>Omawi featuring Alistair Payne, Ingebrigt Håker Flaten <b>Omawi: Live at Roze Tanker</b> <a href="https://doekraw.bandcamp.com/album/omawi-live-at-roze-tanker">bandcamp</a></li>
<li>Guitar Party Power (IMP021) <b>Bob Log III</b> <a href="https://improvedsequence.bandcamp.com/album/guitar-party-power-imp021?from=fanpub_fnb_merch">bandcamp</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6061fa4" class="outline-3">
<h3 id="org6061fa4">2022</h3>
<div class="outline-text-3" id="text-org6061fa4">
<ul class="org-ul">
<li>Mark Wagner <b>S☉N RISE / S☉N OF THE SUN</b> <a href="https://zamzamrec.bandcamp.com/album/s-n-rise-s-n-of-the-sun">bandcamp</a></li>
<li><p>
Adela Mede <b>Szabadság</b> <a href="https://adelamede.bandcamp.com/album/szabads-g-3?entry_type=a&amp;from=newsletter-48620331&amp;newsletter_id=48620331&amp;newsletter_sig=aLi9o4WmsIeiNifL3%2FqQ3mfyM40%3D">bandcamp</a>
</p>
<blockquote>
<p>
I love how the Slovak language is like the Icelandic language. After listening to this album, I've searched a little about Slovakia and found some interesting facts. By the way, I've liked the entire natural-leading process of the album. Feature track: <b><code>6. Interlude III</code></b>!
</p>
</blockquote></li>
<li><p>
Healing Potpourri <b>Paradise</b> <a href="https://healingpotpourri.bandcamp.com/album/paradise?from=embed">bandcamp</a>
</p>
<blockquote>
<p>
Ok, I should confess. At first, I was not too fond of the album because I thought it was a <b><code>Stephan Stevens</code></b> -y album, but as it sought forward, I found it's a complicated multi-instrumental album. With great tuning, orchestra, and lyrics. Great. Great. Favourite Track: <b><code>6. Paradise</code></b>.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9adf0e0" class="outline-2">
<h2 id="org9adf0e0"><b>Jazz</b></h2>
<div class="outline-text-2" id="text-org9adf0e0">
</div>
<div id="outline-container-org603b5b0" class="outline-3">
<h3 id="org603b5b0">2019</h3>
<div class="outline-text-3" id="text-org603b5b0">
<ul class="org-ul">
<li>Enrico Rava &amp; Joe Lovano <b>Roma (Live)</b> <a href="https://open.spotify.com/album/7oJD5GX7laQuDzSz10eKS2">spotify</a></li>
</ul>
</div>
</div>
