music.org
** 2021
- Mira Martin-Gray, Bryan Qu, Karen Ng, Nick Dunston *Trumpet & Drums REMIX Festival* [[https://linaallemano.bandcamp.com/album/trumpet-drums-remix-festival][bandcamp]]
- Milton Man Gogh *The Great Reset* [[https://miltonmangogh.bandcamp.com/album/the-great-reset-2?from=fandiscflw][bandcamp]]
- Florian Arbenz, Francois Moutin, Maikel Vistel *Conversation #4 – Vulcanized* [[https://florianarbenz.bandcamp.com/album/conversation-4-vulcanized?from=fandiscflw][bandcamp]]
- Liminal Space *ILL CONSIDERED* [[https://illconsidered.bandcamp.com/album/liminal-space?from=fanpub_fnb_pr][bandcamp]]
- Playfield *Playfield 1, 2, and 3* [[https://orbit577.bandcamp.com/album/playfield-vol-3-after-life][bandcamp]]
- Raposa Velha *Raposa Velha* [[https://madaboutrecordslabel.bandcamp.com/album/raposa-velha-raposa-velha?from=fandiscflw][bandcamp]]
- Shuffle Demons *All In* [[https://theshuffledemons1.bandcamp.com/album/all-in?from=fandiscflw][bandcamp]]
- Frank Kimbrough *Meanwhile* [[https://newvellerecords.bandcamp.com/album/meantime?from=fandiscflw][bandcamp]]
- Amir ElSaffar *Rivers of Sound: The Other Shore* [[https://amirelsaffartworivers.bandcamp.com/album/rivers-of-sound-the-other-shore][bandcamp]]
- Martin Wind Quartet *My Astorian Queen* [[https://www.youtube.com/watch?v=yGSZwLXvrB4&list=OLAK5uy_nx9guJpda8wLOmlHbZRbaZLC2WSYHROn0][youtube]]
- Gerry Gibbs Thrasher Dream Trios *Songs from My Father* [[https://www.youtube.com/watch?v=fdH8jTeurlY&list=OLAK5uy_l69e7E3hg1x_2E0Te0FyLtaNLf0A-fHQk&index=1][youtube]]
- The Cookers *Look Out!* [[https://www.youtube.com/watch?v=5s9fMj32lyo&list=OLAK5uy_l0rn5RhDcF2NIPnrFYZfO4U2b1W2xbkVQ&index=1][youtube]]
- Veronica Swift *This Bitter Earth* [[https://www.youtube.com/playlist?list=OLAK5uy_lWWiGGnaNn6lWFS13RkPewG0e4iVjxeTQ][youtube]]
- Umlaut Big Band *Mary's Ideas: Umlaut Big Band plays Mary Lou William* [[https://umlautrecords.bandcamp.com/album/marys-ideas-umlaut-big-band-plays-mary-lou-williams][bandcamp]]
- Christian McBride & Inside Straight *Live at the Village Vanguard* [[https://www.youtube.com/watch?v=vwGj1tCSBpU&list=PLPtysUSalP2VnJOJW7QhxyLS7SnXa967Q&index=9][youtube]]
- Eberhard Weber *Once Upon A Time* [[https://open.spotify.com/album/1aSenHcDXIhubEZJMZwuod][spotify]]
- Diogo Alexandre - Bock Ensemble *Pipe Tree* [[https://jaccrecords.bandcamp.com/album/pipe-tree?from=fanpub_fnb][bandcamp]]
- Jakob Bro Arve Henriksen Jorge Rossy *Uma Elmo* [[https://open.spotify.com/album/2YxlIAhEn3nFJUYaI5R8ts][spotify]]
- Daniel Garcia *Via de la Plata* [[https://danielgarciadiego.bandcamp.com/album/via-de-la-plata][bandcamp]]
- Various Artists *Magic Moments 14* [[https://open.spotify.com/album/7AH4CfmNPT45RpKImYpQeX][spotify]]
  #+begin_quote
  As you can guess from the album's name, it's a complication from some memorable songs in a wide spectrum of subgenres of *=Jazz=*.
  #+end_quote
- Funk Is My Religion *Nils Landgren Funk Unit* [[https://nilslandgrenfunkunit.bandcamp.com/album/funk-is-my-religion][bandcamp]]
  #+begin_quote
  Yes, They say that *=Funk=* is a religion. They try to prove it by instruments and vocals. Feature song: *=5. Es in  Memoriam=*.
  #+end_quote
- Lars Danielsson *Cloudland* [[https://larsdanielsson.bandcamp.com/album/cloudland][bandcamp]]
  #+begin_quote
  A good and standard middle east-inspired *=Jazz=* collection, featuring multiple artists in various sub-genres. Feature track: *=3. The Fifth Grade=* and *=6. Lars Danielsson feat. Kinan Azmeh & Kinan Azmeh - Desert of Catanga=*.
  #+end_quote
- Larry Coryell & Philip Catherin *Jazz at Berlin Philarmonic XI: The Last Call* [[https://open.spotify.com/album/2cD1jGlfK02V3VOK3mHsoU][spotify]]
  #+begin_quote
  Featured Track: *=3. Manha De Carnaval - Live=*. 
  #+end_quote
- David Helbock, Sebastian Studnitzky, and Arna Jensen *The New Cool* [[https://open.spotify.com/album/6jpDo7lFK5RUMNkubr4jPi][spotify]]
** 2022
- Joel Lyssarides *Stay Now* [[https://joellyssarides.bandcamp.com/releases][bandcamp]]
- Gordon Grdina's Haram *Night's Quietest Hour* [[https://gordongrdina.bandcamp.com/album/nights-quietest-hour?from=fandiscflw][bandcamp]]
  #+begin_quote
  A classic Fusion of *=Jazz=*, *=Arabic=*, and *[[https://en.wikipedia.org/wiki/Bandari_music][Bandari]]* music. Feature track: *=3. Dulab Bayati=*
  #+end_quote 
- Branko Mataja *Over Fields And Mountains* [[https://brankomataja.bandcamp.com/album/over-fields-and-mountains?from=fanpub_fnb_pr][bandcamp]]
  #+begin_quote
  Something between *Ennio Morricone* and many others!
  #+end_quote
- Smith Komma John *Music For Humans* [[https://smithkommajohn.bandcamp.com/album/music-for-humans?from=fanpub_fnb][bandcamp]]
  #+begin_quote
  Norway!
  #+end_quote
- Duval Timphty *Meeting with a Judas Tree* [[https://duvaltimothy.bandcamp.com/album/meeting-with-a-judas-tree][bandcamp]]
  #+begin_quote
  A great experimental ~fusion~ piece of work. You can hear some post-rockish sounds merged with electronic music. Besides the artist claims that he inspired by ~hip-hop~. I couldn't hear anything from this point, at least at three fist listening of it. Featured Track: *=2. Wood ft. Yu Su=*.
  #+end_quote
- Bill Frisell *Four (Blue Note)* [[https://open.spotify.com/album/0GhCs8GREBNY1uUZhHQuYr][Spotify]]
  #+begin_quote
  This may be the last =jazz= album I reviewed in 2022. There are a bunch of albums I collected or ignored to listen to later. But I'm happy I listened to this album only one month after its release. You hear many "fresh" and harmonic sounds from the first track. I can get sleepy, excited, and even sad when you enjoy the quality of the mix, primarily when you focus on the drum's mix and mastering. You can feel every step of the piano's pedal changing, and even more, you can see the saxophone's key pressings in your imagination. 
  #+end_quote
* **Metal*
** Death
*** 2022
- Septicflesh *Modern Primitive* [[https://septicflesh.bandcamp.com/album/modern-primitive?from=fanpub_nfnb_pr][bandcamp]]
  #+begin_quote
  Finally, Septicflesh is here! A great greek band with a homogeneous discography in the manner of album art but not in their taste in music. Their last album is a fusion. A fusion of folk music and death, lyrical verses, and of course, enough harshness. Featured Track: *=3. Self-Eater=*.
  #+end_quote
** Doom
