music.html
<div id="outline-container-orgc87babb" class="outline-3">
<h3 id="orgc87babb">2021</h3>
<div class="outline-text-3" id="text-orgc87babb">
<ul class="org-ul">
<li>Mira Martin-Gray, Bryan Qu, Karen Ng, Nick Dunston <b>Trumpet &amp; Drums REMIX Festival</b> <a href="https://linaallemano.bandcamp.com/album/trumpet-drums-remix-festival">bandcamp</a></li>
<li>Milton Man Gogh <b>The Great Reset</b> <a href="https://miltonmangogh.bandcamp.com/album/the-great-reset-2?from=fandiscflw">bandcamp</a></li>
<li>Florian Arbenz, Francois Moutin, Maikel Vistel <b>Conversation #4 – Vulcanized</b> <a href="https://florianarbenz.bandcamp.com/album/conversation-4-vulcanized?from=fandiscflw">bandcamp</a></li>
<li>Liminal Space <b>ILL CONSIDERED</b> <a href="https://illconsidered.bandcamp.com/album/liminal-space?from=fanpub_fnb_pr">bandcamp</a></li>
<li>Playfield <b>Playfield 1, 2, and 3</b> <a href="https://orbit577.bandcamp.com/album/playfield-vol-3-after-life">bandcamp</a></li>
<li>Raposa Velha <b>Raposa Velha</b> <a href="https://madaboutrecordslabel.bandcamp.com/album/raposa-velha-raposa-velha?from=fandiscflw">bandcamp</a></li>
<li>Shuffle Demons <b>All In</b> <a href="https://theshuffledemons1.bandcamp.com/album/all-in?from=fandiscflw">bandcamp</a></li>
<li>Frank Kimbrough <b>Meanwhile</b> <a href="https://newvellerecords.bandcamp.com/album/meantime?from=fandiscflw">bandcamp</a></li>
<li>Amir ElSaffar <b>Rivers of Sound: The Other Shore</b> <a href="https://amirelsaffartworivers.bandcamp.com/album/rivers-of-sound-the-other-shore">bandcamp</a></li>
<li>Martin Wind Quartet <b>My Astorian Queen</b> <a href="https://www.youtube.com/watch?v=yGSZwLXvrB4&amp;list=OLAK5uy_nx9guJpda8wLOmlHbZRbaZLC2WSYHROn0">youtube</a></li>
<li>Gerry Gibbs Thrasher Dream Trios <b>Songs from My Father</b> <a href="https://www.youtube.com/watch?v=fdH8jTeurlY&amp;list=OLAK5uy_l69e7E3hg1x_2E0Te0FyLtaNLf0A-fHQk&amp;index=1">youtube</a></li>
<li>The Cookers <b>Look Out!</b> <a href="https://www.youtube.com/watch?v=5s9fMj32lyo&amp;list=OLAK5uy_l0rn5RhDcF2NIPnrFYZfO4U2b1W2xbkVQ&amp;index=1">youtube</a></li>
<li>Veronica Swift <b>This Bitter Earth</b> <a href="https://www.youtube.com/playlist?list=OLAK5uy_lWWiGGnaNn6lWFS13RkPewG0e4iVjxeTQ">youtube</a></li>
<li>Umlaut Big Band <b>Mary's Ideas: Umlaut Big Band plays Mary Lou William</b> <a href="https://umlautrecords.bandcamp.com/album/marys-ideas-umlaut-big-band-plays-mary-lou-williams">bandcamp</a></li>
<li>Christian McBride &amp; Inside Straight <b>Live at the Village Vanguard</b> <a href="https://www.youtube.com/watch?v=vwGj1tCSBpU&amp;list=PLPtysUSalP2VnJOJW7QhxyLS7SnXa967Q&amp;index=9">youtube</a></li>
<li>Eberhard Weber <b>Once Upon A Time</b> <a href="https://open.spotify.com/album/1aSenHcDXIhubEZJMZwuod">spotify</a></li>
<li>Diogo Alexandre - Bock Ensemble <b>Pipe Tree</b> <a href="https://jaccrecords.bandcamp.com/album/pipe-tree?from=fanpub_fnb">bandcamp</a></li>
<li>Jakob Bro Arve Henriksen Jorge Rossy <b>Uma Elmo</b> <a href="https://open.spotify.com/album/2YxlIAhEn3nFJUYaI5R8ts">spotify</a></li>
<li>Daniel Garcia <b>Via de la Plata</b> <a href="https://danielgarciadiego.bandcamp.com/album/via-de-la-plata">bandcamp</a></li>
<li><p>
Various Artists <b>Magic Moments 14</b> <a href="https://open.spotify.com/album/7AH4CfmNPT45RpKImYpQeX">spotify</a>
</p>
<blockquote>
<p>
As you can guess from the album's name, it's a complication from some memorable songs in a wide spectrum of subgenres of <b><code>Jazz</code></b>.
</p>
</blockquote></li>
<li><p>
Funk Is My Religion <b>Nils Landgren Funk Unit</b> <a href="https://nilslandgrenfunkunit.bandcamp.com/album/funk-is-my-religion">bandcamp</a>
</p>
<blockquote>
<p>
Yes, They say that <b><code>Funk</code></b> is a religion. They try to prove it by instruments and vocals. Feature song: <b><code>5. Es in  Memoriam</code></b>.
</p>
</blockquote></li>
<li><p>
Lars Danielsson <b>Cloudland</b> <a href="https://larsdanielsson.bandcamp.com/album/cloudland">bandcamp</a>
</p>
<blockquote>
<p>
A good and standard middle east-inspired <b><code>Jazz</code></b> collection, featuring multiple artists in various sub-genres. Feature track: <b><code>3. The Fifth Grade</code></b> and <b><code>6. Lars Danielsson feat. Kinan Azmeh &amp; Kinan Azmeh - Desert of Catanga</code></b>.
</p>
</blockquote></li>
<li><p>
Larry Coryell &amp; Philip Catherin <b>Jazz at Berlin Philarmonic XI: The Last Call</b> <a href="https://open.spotify.com/album/2cD1jGlfK02V3VOK3mHsoU">spotify</a>
</p>
<blockquote>
<p>
Featured Track: <b><code>3. Manha De Carnaval - Live</code></b>. 
</p>
</blockquote></li>
<li>David Helbock, Sebastian Studnitzky, and Arna Jensen <b>The New Cool</b> <a href="https://open.spotify.com/album/6jpDo7lFK5RUMNkubr4jPi">spotify</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd2b7088" class="outline-3">
<h3 id="orgd2b7088">2022</h3>
<div class="outline-text-3" id="text-orgd2b7088">
<ul class="org-ul">
<li>Joel Lyssarides <b>Stay Now</b> <a href="https://joellyssarides.bandcamp.com/releases">bandcamp</a></li>
<li><p>
Gordon Grdina's Haram <b>Night's Quietest Hour</b> <a href="https://gordongrdina.bandcamp.com/album/nights-quietest-hour?from=fandiscflw">bandcamp</a>
</p>
<blockquote>
<p>
A classic Fusion of <b><code>Jazz</code></b>, <b><code>Arabic</code></b>, and <b><a href="https://en.wikipedia.org/wiki/Bandari_music">Bandari</a></b> music. Feature track: <b><code>3. Dulab Bayati</code></b>
</p>
</blockquote></li>
<li><p>
Branko Mataja <b>Over Fields And Mountains</b> <a href="https://brankomataja.bandcamp.com/album/over-fields-and-mountains?from=fanpub_fnb_pr">bandcamp</a>
</p>
<blockquote>
<p>
Something between <b>Ennio Morricone</b> and many others!
</p>
</blockquote></li>
<li><p>
Smith Komma John <b>Music For Humans</b> <a href="https://smithkommajohn.bandcamp.com/album/music-for-humans?from=fanpub_fnb">bandcamp</a>
</p>
<blockquote>
<p>
Norway!
</p>
</blockquote></li>
<li><p>
Duval Timphty <b>Meeting with a Judas Tree</b> <a href="https://duvaltimothy.bandcamp.com/album/meeting-with-a-judas-tree">bandcamp</a>
</p>
<blockquote>
<p>
A great experimental <code>fusion</code> piece of work. You can hear some post-rockish sounds merged with electronic music. Besides the artist claims that he inspired by <code>hip-hop</code>. I couldn't hear anything from this point, at least at three fist listening of it. Featured Track: <b><code>2. Wood ft. Yu Su</code></b>.
</p>
</blockquote></li>
<li><p>
Bill Frisell <b>Four (Blue Note)</b> <a href="https://open.spotify.com/album/0GhCs8GREBNY1uUZhHQuYr">Spotify</a>
</p>
<blockquote>
<p>
This may be the last <code>jazz</code> album I reviewed in 2022. There are a bunch of albums I collected or ignored to listen to later. But I'm happy I listened to this album only one month after its release. You hear many "fresh" and harmonic sounds from the first track. I can get sleepy, excited, and even sad when you enjoy the quality of the mix, primarily when you focus on the drum's mix and mastering. You can feel every step of the piano's pedal changing, and even more, you can see the saxophone's key pressings in your imagination. 
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4681010" class="outline-2">
<h2 id="org4681010"><b>*Metal</b></h2>
<div class="outline-text-2" id="text-org4681010">
</div>
<div id="outline-container-org640bf45" class="outline-3">
<h3 id="org640bf45">Black</h3>
<div class="outline-text-3" id="text-org640bf45">
<ul class="org-ul">
<li><p>
Entropia <b>Total</b> <a href="https://agoniarecords.bandcamp.com/album/total?from=embed">bandcamp</a>
</p>
<blockquote>
<p>
A very harsh and progressive backend post metal with a taste of <code>black metal</code>. If you ask me I prefer this kind of post metal instead of some repeating reefs and melodies. Vocals in this album id gorgeous. Featured Track: <b><code>5. Final</code></b>.
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-org97c5667" class="outline-3">
<h3 id="org97c5667">Death</h3>
<div class="outline-text-3" id="text-org97c5667">
</div>
<div id="outline-container-orgf02dfee" class="outline-4">
<h4 id="orgf02dfee">2022</h4>
<div class="outline-text-4" id="text-orgf02dfee">
<ul class="org-ul">
<li><p>
Septicflesh <b>Modern Primitive</b> <a href="https://septicflesh.bandcamp.com/album/modern-primitive?from=fanpub_nfnb_pr">bandcamp</a>
</p>
<blockquote>
<p>
Finally, Septicflesh is here! A great greek band with a homogeneous discography in the manner of album art but not in their taste in music. Their last album is a fusion. A fusion of folk music and death, lyrical verses, and of course, enough harshness. Featured Track: <b><code>3. Self-Eater</code></b>.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
