music.org
*** 2021
- Abysmal Grief *Funeral Cult of Personality* [[https://sunandmoonrecords.bandcamp.com/album/funeral-cult-of-personality][bandcamp]]
- Funeralium *Funeralium* [[https://funeralium.bandcamp.com/album/funeralium?from=fannewrel][bandcamp]]
- Swallow The Sun *Moonflowers* [[https://open.spotify.com/album/5RuHZCFV4cYtFIrj4NIXek][spotify]]
- Funeral Mist *Deiform* [[https://funeralmist.bandcamp.com/album/deiform?from=fandiscflw][bandcamp]]
- Akelei *Een van ons* [[https://akelei.bandcamp.com/album/een-van-ons?from=fandiscflw][bandcamp]]
- So Hideous *None But a Pure Heart Can Sing* [[https://silentpendulumrecords.bandcamp.com/album/none-but-a-pure-heart-can-sing?from=fanpub_fnb_pr][bandcamp]]
*** 2022
- Where Myth Becomes Memory *Rolo Tomassi* [[https://rolotomassi.bandcamp.com/album/where-myth-becomes-memory?from=fanpub_fnb_pr][bandcamp]]
- Dismalimerence, Nurez, olim, and The Wolf Garden *Recurrence (split)* [[https://thewolfgarden.bandcamp.com/album/recurrence-split?from=fanpub_fnb_pr&utm_campaign=thewolfgarden+album+recurrence-split][bandcamp]]
  #+begin_quote
  I just wondered about how there is a huge atmosphere around each song. Screams, melodies, and tonality are in a perfect balance. Favourite Track: *=Nurez - Sommer=*
  #+end_quote
- Obsessions  *Notturno* [[https://hypnoticdirgerecords.bandcamp.com/album/obsessions][bandcamp]]
  #+begin_quote
  Holy *=Doom=*, holy scream, holy poem. A very cheerful EP where you can find the deepest kind of darkness you want. Feature track *=3.Falling=*.
  #+end_quote
- Pyrithe *Monuments to Impermanence* [[https://gileadmedia.bandcamp.com/album/monuments-to-impermanence][bandcamp]]
  #+begin_quote
  I wasn't sure if I should put this album on the recommendation list. So, I listened to it twice; after that, the fifth Track, *=5. Luminous=* to do that. Drums player, you nailed it!
  #+end_quote
- Nova *Sylvaine* [[https://sylvainemusic.bandcamp.com/album/nova?from=fanpub_nfnb_pr][bandcamp]]
  #+begin_quote
  It hit me at *=2. Mono No Aware=* where clean soprano voice combined by growl vocal. You know, That amazing moment...
  #+end_quote
- Darkher *The Buried Strom* [[https://darkher-uk.bandcamp.com/album/the-buried-storm?from=fanpub_nfnb_pr][bandcamp]]
  #+begin_quote
  The album has all factors and materials. But it wouldn't start from the first Track. It makes you thirsty until you've reached *=7. Immortals=*, but when it starts, it will not end very soon.
  #+end_quote
- Mournful Congregation *The Exuviae of Gods - Part I* [[https://20buckspin.bandcamp.com/album/the-exuviae-of-gods-part-i?from=fanpub_fnb_pr&fan_action_pane=login&fan_action=follow][bandcamp]]
  #+begin_quote
  A classic doom metal, with long reefs, great basses, and lyrical procedure. Feature track: *=3. An Epic Dream Of Desire=*.
  #+end_quote
- Sadness *To despair of ... (2014)* [[https://sadnessmusic.bandcamp.com/album/to-despair-of?from=fanpub_fnb&utm_source=album_release&utm_medium=email&utm_content=fanpub_fnb&utm_campaign=sadnessmusic+album+to-despair-of][bandcamp]]
  #+begin_quote
  Re-announcing this album exposed this masterpiece to me. I don't want select albums released before 2020 here, but in this case, I do.
  #+end_quote
- Deathwhite *Grey Everlasting* [[https://deathwhite.bandcamp.com/album/grey-everlasting?from=fanpub_nfnb_pr&utm_source=album_release&utm_medium=email&utm_content=fanpub_nfnb_pr&utm_campaign=deathwhite+album+grey-everlasting][bandcamp]]
  #+begin_quote
  A silent, heavy, and atmospheric album by an American band. I wouldn't say I like how they promoted their album by tagging other bands on the Bandcamp page, but it tells us: Amorphis, Katatonia (ew), Swallow the Sun, etc. Favourite Track: *=10. Blood and Ruin=*.
  #+end_quote
** Progressive
- Venus Principle *Stand In Your Light* [[https://venusprinciple.bandcamp.com/album/stand-in-your-light-deluxe-edition?from=fanpub_nfnb_pr][bandcamp]]
  #+begin_quote
Let's be honest. It's too rare for me to listen to a combo of male and female vocals and not enjoy the song. In this case, the *=fifth=* track named *=The Lord He Giveth And He Taketh Away=* got me. 
  #+end_quote
- Ashenspire *Hostile Architecture* [[https://www.youtube.com/watch?v=9e7QpOwvXOs&list=OLAK5uy_nxZGJsqQpwwPwwxWf82xfKF8Y8YrwKreM&index=1][youtube]]
  #+begin_quote
  A guy said it's a "Post Black Metal." But no. It's a Fusion Jazz Post-Metal. No, wait, it's Spoken Fusion Post Jazz Metal. Nah, it's Progressive Spoken Fusion Post Jazz Metal, right? It's better. Even now, I missed the "classical" part. It's all. It's every kind of intelligence that you can use in an album. Favourite Track: *=3. Plattenbau Persephone Praxis=*.
  #+end_quote
* *Noise*
** 2022
- Portal to the God Damn Blood Dimension *Rotten Fruit; Regular Orchard* [[https://portaltothegoddamnblooddimension.bandcamp.com/album/rotten-fruit-regular-orchard?from=fandiscflw][bandcamp]]
  #+begin_quote
  A double-track EP with noise, verse-like spoken words, and screams.
  #+end_quote
- R. Weis *Installed: Sound For Exhibitions* [[https://wormholeworld.bandcamp.com/album/installed-sound-for-exhibitions?from=fanpub_fnb_pr][bandcamp]]
  #+begin_quote
  What do you want from a *=noise=* album? I answer you I need every sound which it can define under chaotic noises. Spoken words, whispers, instruments, and urban sounds. All of them are in this album. Featured Track: *=11. Requiem for a Paperweight (Chapters 5 and 6)=*.
  #+end_quote
- Heavy Clound *Crossing The Water* [[[https://wormholeworld.bandcamp.com/album/crossing-the-water?from=fanpub_fnb_pr][bandcamp]]]
  #+begin_quote
  Ok, I'm a little biased, but the fourth Track *=Their leaves do not wish us to hurry=* is great. Listen to find out what I mean.
  #+end_quote
* *Post-everything*
** 2021
- Hope Drone *Husk* [[https://hopedrone.bandcamp.com/album/husk][bandcamp]]
- Der Weg Einer Freihei *Noktvrn* [[https://derwegeinerfreiheitsom.bandcamp.com/album/noktvrn?from=fanpub_nfnb_pr][bandcamp]]
- Secret Gardens *Tundra* [[https://secretgardens.bandcamp.com/album/tundra][bandcamp]]
  #+begin_quote
  I'm skeptical about recently released albums. But Tundra changed my mind. It's a combo of grunge, spoken words, nature-ambient-new age with real rock roots. Favourite Track: *=3. Silliness (feat. Erin Reus)=*.
  #+end_quote
  #+begin_quote
  _PS_ Ok, I've changed my mind; my favourite Track is *=6. I'm Fucking Tired of Being Sad=*.
  #+end_quote
- Black Flak and the Nightmare Fighters *Ad Meliora* [[https://blackflakslc.bandcamp.com/album/ad-meliora][bandcamp]]
  #+begin_quote
  
  #+end_quote
