music.html
<div id="outline-container-orgf0233d2" class="outline-3">
<h3 id="orgf0233d2">Doom</h3>
<div class="outline-text-3" id="text-orgf0233d2">
</div>
<div id="outline-container-org53d8ca6" class="outline-4">
<h4 id="org53d8ca6">2021</h4>
<div class="outline-text-4" id="text-org53d8ca6">
<ul class="org-ul">
<li>Abysmal Grief <b>Funeral Cult of Personality</b> <a href="https://sunandmoonrecords.bandcamp.com/album/funeral-cult-of-personality">bandcamp</a></li>
<li>Funeralium <b>Funeralium</b> <a href="https://funeralium.bandcamp.com/album/funeralium?from=fannewrel">bandcamp</a></li>
<li>Swallow The Sun <b>Moonflowers</b> <a href="https://open.spotify.com/album/5RuHZCFV4cYtFIrj4NIXek">spotify</a></li>
<li>Funeral Mist <b>Deiform</b> <a href="https://funeralmist.bandcamp.com/album/deiform?from=fandiscflw">bandcamp</a></li>
<li>Akelei <b>Een van ons</b> <a href="https://akelei.bandcamp.com/album/een-van-ons?from=fandiscflw">bandcamp</a></li>
<li>So Hideous <b>None But a Pure Heart Can Sing</b> <a href="https://silentpendulumrecords.bandcamp.com/album/none-but-a-pure-heart-can-sing?from=fanpub_fnb_pr">bandcamp</a></li>
</ul>
</div>
</div>
<div id="outline-container-org035c408" class="outline-4">
<h4 id="org035c408">2022</h4>
<div class="outline-text-4" id="text-org035c408">
<ul class="org-ul">
<li>Where Myth Becomes Memory <b>Rolo Tomassi</b> <a href="https://rolotomassi.bandcamp.com/album/where-myth-becomes-memory?from=fanpub_fnb_pr">bandcamp</a></li>
<li><p>
Dismalimerence, Nurez, olim, and The Wolf Garden <b>Recurrence (split)</b> <a href="https://thewolfgarden.bandcamp.com/album/recurrence-split?from=fanpub_fnb_pr&amp;utm_campaign=thewolfgarden+album+recurrence-split">bandcamp</a>
</p>
<blockquote>
<p>
I just wondered about how there is a huge atmosphere around each song. Screams, melodies, and tonality are in a perfect balance. Favourite Track: <b><code>Nurez - Sommer</code></b>
</p>
</blockquote></li>
<li><p>
Obsessions  <b>Notturno</b> <a href="https://hypnoticdirgerecords.bandcamp.com/album/obsessions">bandcamp</a>
</p>
<blockquote>
<p>
Holy <b><code>Doom</code></b>, holy scream, holy poem. A very cheerful EP where you can find the deepest kind of darkness you want. Feature track <b><code>3.Falling</code></b>.
</p>
</blockquote></li>
<li><p>
Pyrithe <b>Monuments to Impermanence</b> <a href="https://gileadmedia.bandcamp.com/album/monuments-to-impermanence">bandcamp</a>
</p>
<blockquote>
<p>
I wasn't sure if I should put this album on the recommendation list. So, I listened to it twice; after that, the fifth Track, <b><code>5. Luminous</code></b> to do that. Drums player, you nailed it!
</p>
</blockquote></li>
<li><p>
Nova <b>Sylvaine</b> <a href="https://sylvainemusic.bandcamp.com/album/nova?from=fanpub_nfnb_pr">bandcamp</a>
</p>
<blockquote>
<p>
It hit me at <b><code>2. Mono No Aware</code></b> where clean soprano voice combined by growl vocal. You know, That amazing moment&#x2026;
</p>
</blockquote></li>
<li><p>
Darkher <b>The Buried Strom</b> <a href="https://darkher-uk.bandcamp.com/album/the-buried-storm?from=fanpub_nfnb_pr">bandcamp</a>
</p>
<blockquote>
<p>
The album has all factors and materials. But it wouldn't start from the first Track. It makes you thirsty until you've reached <b><code>7. Immortals</code></b>, but when it starts, it will not end very soon.
</p>
</blockquote></li>
<li><p>
Mournful Congregation <b>The Exuviae of Gods - Part I</b> <a href="https://20buckspin.bandcamp.com/album/the-exuviae-of-gods-part-i?from=fanpub_fnb_pr&amp;fan_action_pane=login&amp;fan_action=follow">bandcamp</a>
</p>
<blockquote>
<p>
A classic doom metal, with long reefs, great basses, and lyrical procedure. Feature track: <b><code>3. An Epic Dream Of Desire</code></b>.
</p>
</blockquote></li>
<li><p>
Sadness <b>To despair of &#x2026; (2014)</b> <a href="https://sadnessmusic.bandcamp.com/album/to-despair-of?from=fanpub_fnb&amp;utm_source=album_release&amp;utm_medium=email&amp;utm_content=fanpub_fnb&amp;utm_campaign=sadnessmusic+album+to-despair-of">bandcamp</a>
</p>
<blockquote>
<p>
Re-announcing this album exposed this masterpiece to me. I don't want select albums released before 2020 here, but in this case, I do.
</p>
</blockquote></li>
<li><p>
Deathwhite <b>Grey Everlasting</b> <a href="https://deathwhite.bandcamp.com/album/grey-everlasting?from=fanpub_nfnb_pr&amp;utm_source=album_release&amp;utm_medium=email&amp;utm_content=fanpub_nfnb_pr&amp;utm_campaign=deathwhite+album+grey-everlasting">bandcamp</a>
</p>
<blockquote>
<p>
A silent, heavy, and atmospheric album by an American band. I wouldn't say I like how they promoted their album by tagging other bands on the Bandcamp page, but it tells us: Amorphis, Katatonia (ew), Swallow the Sun, etc. Favourite Track: <b><code>10. Blood and Ruin</code></b>.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8a15508" class="outline-3">
<h3 id="org8a15508">Progressive</h3>
<div class="outline-text-3" id="text-org8a15508">
<ul class="org-ul">
<li><p>
Venus Principle <b>Stand In Your Light</b> <a href="https://venusprinciple.bandcamp.com/album/stand-in-your-light-deluxe-edition?from=fanpub_nfnb_pr">bandcamp</a>
</p>
<blockquote>
<p>
Let's be honest. It's too rare for me to listen to a combo of male and female vocals and not enjoy the song. In this case, the <b><code>fifth</code></b> track named <b><code>The Lord He Giveth And He Taketh Away</code></b> got me. 
</p>
</blockquote></li>
<li><p>
Ashenspire <b>Hostile Architecture</b> <a href="https://www.youtube.com/watch?v=9e7QpOwvXOs&amp;list=OLAK5uy_nxZGJsqQpwwPwwxWf82xfKF8Y8YrwKreM&amp;index=1">youtube</a>
</p>
<blockquote>
<p>
A guy said it's a "Post Black Metal." But no. It's a Fusion Jazz Post-Metal. No, wait, it's Spoken Fusion Post Jazz Metal. Nah, it's Progressive Spoken Fusion Post Jazz Metal, right? It's better. Even now, I missed the "classical" part. It's all. It's every kind of intelligence that you can use in an album. Favourite Track: <b><code>3. Plattenbau Persephone Praxis</code></b>.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5adfc11" class="outline-2">
<h2 id="org5adfc11"><b>Noise</b></h2>
<div class="outline-text-2" id="text-org5adfc11">
</div>
<div id="outline-container-orgb4cafe1" class="outline-3">
<h3 id="orgb4cafe1">2022</h3>
<div class="outline-text-3" id="text-orgb4cafe1">
<ul class="org-ul">
<li><p>
Portal to the God Damn Blood Dimension <b>Rotten Fruit; Regular Orchard</b> <a href="https://portaltothegoddamnblooddimension.bandcamp.com/album/rotten-fruit-regular-orchard?from=fandiscflw">bandcamp</a>
</p>
<blockquote>
<p>
A double-track EP with noise, verse-like spoken words, and screams.
</p>
</blockquote></li>
<li><p>
R. Weis <b>Installed: Sound For Exhibitions</b> <a href="https://wormholeworld.bandcamp.com/album/installed-sound-for-exhibitions?from=fanpub_fnb_pr">bandcamp</a>
</p>
<blockquote>
<p>
What do you want from a <b><code>noise</code></b> album? I answer you I need every sound which it can define under chaotic noises. Spoken words, whispers, instruments, and urban sounds. All of them are in this album. Featured Track: <b><code>11. Requiem for a Paperweight (Chapters 5 and 6)</code></b>.
</p>
</blockquote></li>
<li><p>
Heavy Clound <b>Crossing The Water</b> [<a href="https://wormholeworld.bandcamp.com/album/crossing-the-water?from=fanpub_fnb_pr">bandcamp</a>]
</p>
<blockquote>
<p>
Ok, I'm a little biased, but the fourth Track <b><code>Their leaves do not wish us to hurry</code></b> is great. Listen to find out what I mean.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6444219" class="outline-2">
<h2 id="org6444219"><b>Post-everything</b></h2>
<div class="outline-text-2" id="text-org6444219">
</div>
<div id="outline-container-orgdde0054" class="outline-3">
<h3 id="orgdde0054">2021</h3>
<div class="outline-text-3" id="text-orgdde0054">
<ul class="org-ul">
<li>Hope Drone <b>Husk</b> <a href="https://hopedrone.bandcamp.com/album/husk">bandcamp</a></li>
<li>Der Weg Einer Freihei <b>Noktvrn</b> <a href="https://derwegeinerfreiheitsom.bandcamp.com/album/noktvrn?from=fanpub_nfnb_pr">bandcamp</a></li>
<li><p>
Secret Gardens <b>Tundra</b> <a href="https://secretgardens.bandcamp.com/album/tundra">bandcamp</a>
</p>
<blockquote>
<p>
I'm skeptical about recently released albums. But Tundra changed my mind. It's a combo of grunge, spoken words, nature-ambient-new age with real rock roots. Favourite Track: <b><code>3. Silliness (feat. Erin Reus)</code></b>.
</p>
</blockquote>
<blockquote>
<p>
<span class="underline">PS</span> Ok, I've changed my mind; my favourite Track is <b><code>6. I'm Fucking Tired of Being Sad</code></b>.
</p>
</blockquote></li>
<li><p>
Black Flak and the Nightmare Fighters <b>Ad Meliora</b> <a href="https://blackflakslc.bandcamp.com/album/ad-meliora">bandcamp</a>
</p>
<blockquote>
<p>
  
</p>
</blockquote></li>
</ul>
</div>
</div>
