music.org
** 2022
- Caroline *Caroline* [[https://open.spotify.com/album/4X12VfRomM649eKXd1qKMf][spotify]]
  #+begin_quote
  After a few months, I finally found an excellent vocal post-rock album. I'm pleased and blessed. Feature track: *=2. Good morning (red)=*.
  #+end_quote
- old songs 2014 *Sadness* [[https://sadnessmusic.bandcamp.com/album/old-songs-2014?from=fanpub_fnb][bandcamp]]
  #+begin_quote
  Featured Track: *=4. loss=*.
  #+end_quote
- Cancel the Apocalypse *Terminus Stairway* [[https://open.spotify.com/album/0J8ciXLG7K6bLwmzQMMSlW?si=0b700607e4874874][spotify]]
  #+begin_quote
Feature track: *=8. I Should Never Have a Stop=*.
  #+end_quote


