music.html
<div id="outline-container-org3c36214" class="outline-3">
<h3 id="org3c36214">2022</h3>
<div class="outline-text-3" id="text-org3c36214">
<ul class="org-ul">
<li><p>
Caroline <b>Caroline</b> <a href="https://open.spotify.com/album/4X12VfRomM649eKXd1qKMf">spotify</a>
</p>
<blockquote>
<p>
After a few months, I finally found an excellent vocal post-rock album. I'm pleased and blessed. Feature track: <b><code>2. Good morning (red)</code></b>.
</p>
</blockquote></li>
<li><p>
old songs 2014 <b>Sadness</b> <a href="https://sadnessmusic.bandcamp.com/album/old-songs-2014?from=fanpub_fnb">bandcamp</a>
</p>
<blockquote>
<p>
Featured Track: <b><code>4. loss</code></b>.
</p>
</blockquote></li>
<li><p>
Cancel the Apocalypse <b>Terminus Stairway</b> <a href="https://open.spotify.com/album/0J8ciXLG7K6bLwmzQMMSlW?si=0b700607e4874874">spotify</a>
</p>
<blockquote>
<p>
Feature track: <b><code>8. I Should Never Have a Stop</code></b>.
</p>
</blockquote></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: <a href="https://shosseinib.github.io">shosseinib</a>, a noise enthusiast</p>
<p class="date">Created: 2023-03-24 Fri 15:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>